In [1]:
import pandas as pd
import numpy as np

In [32]:
a=np.arange(0,25).reshape(5,5)
a

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [33]:
columns=list("abcde")
indexes=["row"+str(i+1) for i in range(5)]

df=pd.DataFrame(a,columns=columns,index=indexes)
df

       a   b   c   d   e
row1   0   1   2   3   4
row2   5   6   7   8   9
row3  10  11  12  13  14
row4  15  16  17  18  19
row5  20  21  22  23  24

In [38]:
df.iloc[0].map(lambda a:a**2 if a%2==0 else a-5)

a     0
b    -4
c     4
d    -2
e    16
Name: row1, dtype: int64

Map function is applied to the series whereas Apply is applied to the dataframe.

In [17]:
df.a.map(lambda a:a**3) #applied to the first column

0       0
1     125
2    1000
3    3375
4    8000
Name: a, dtype: int64

In [39]:
df

       a   b   c   d   e
row1   0   1   2   3   4
row2   5   6   7   8   9
row3  10  11  12  13  14
row4  15  16  17  18  19
row5  20  21  22  23  24

In [43]:
df.index[0]

'row1'

In [42]:
df.columns[0]

'a'

In [44]:
df.values

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [47]:
type(df.values)

numpy.ndarray

In [48]:
df

       a   b   c   d   e
row1   0   1   2   3   4
row2   5   6   7   8   9
row3  10  11  12  13  14
row4  15  16  17  18  19
row5  20  21  22  23  24

In [52]:
df.apply(np.sqrt,axis=0,result_type='broadcast')

             a         b         c         d         e
row1  0.000000  1.000000  1.414214  1.732051  2.000000
row2  2.236068  2.449490  2.645751  2.828427  3.000000
row3  3.162278  3.316625  3.464102  3.605551  3.741657
row4  3.872983  4.000000  4.123106  4.242641  4.358899
row5  4.472136  4.582576  4.690416  4.795832  4.898979

In [53]:
df

       a   b   c   d   e
row1   0   1   2   3   4
row2   5   6   7   8   9
row3  10  11  12  13  14
row4  15  16  17  18  19
row5  20  21  22  23  24